function y = fitness_7(t)
load('D:\FOLDER\桌面\校数模\2017B\L-I-20C.mat')
load('D:\FOLDER\桌面\校数模\2017B\b.mat')
lambda = 0.327974911948322;
Ith0 = 2.09792442194657E-05;
Rth = 3593.49598351965;
a_0 = 0.00245295354589810;
a_1 = -2.24461489568760E-05;
a_2 = 8.55495131262933E-08;
a_3 = -3.04196846538548E-10;
a_4 = 6.38679397411974E-13;
i = 0.011;
% t = 380.276;
ui = b(1) + b(2).*i + b(3).*i.^2 + b(4).*i.^3 + b(5).*i.^4 + b(6).*i.^5;
y = lambda.*Rth.*a_4.*t.^4 + lambda.*Rth.*a_3.*t.^3 + lambda.*Rth.*a_2.*t.^2 + (lambda.*Rth.*a_1 - 1).*t + 293.15 + Rth.*(lambda.*(Ith0 - i + a_0) + i.*ui);
% y = abs(y);
end